In [24]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [25]:
df =pd.read_csv('SIT_Student_Information.csv')

In [26]:
sorted_df = df.sort_values(by='Age')

In [27]:
print(sorted_df)

                           Name   Age  Gender         Year       Taluka
84       Saurabh Santosh Kanade    18    Male   First Year       Parner
83    Mayuresh Bapurao Babhale     18    Male   First Year      Basmath
70                 Sahil Zaware    18    Male   First Year       Parner
71        Gauri Vishal Gaikwad     18  Female   First Year        Maval
75    Rohit Bahirnath Belhekar     18    Male   First Year      Newasa
..                          ...   ...     ...          ...          ...
39         Sagar Gangaram Pawar    24    Male   Third Year       Haveli
45  Jagdish Tulshiram Kamlekar     24    Male   Third Year  Naigaon(kh)
28       Sakshi Gurunath Nagane  2000  Female  Fourth Year       Haveli
30        Tejas santosh parkhe   2002    Male   Third Year       Karjat
16          Aditya Ananta Kadu   2002    Male   Third Year       Maval

[87 rows x 5 columns]

In [28]:
sorted_df = df.sort_values(by='Taluka')

In [29]:
print(sorted_df)

                          Name  Age  Gender         Year     Taluka
35                  **********   23    Male  Second Year     ******
7               Malay Divekar    20    Male   Third Year          -
12    Tambade Shubham Shivaji    21    Male   Third Year  AMBEGAON
67            Himanshu Agrawal   20    Male   Third Year      Akola
27              Sahil karnekar   21    Male   Third Year     Alibag
..                         ...  ...     ...          ...        ...
14                 Aryan kalea   20    Male   Third Year       Vapi
19  Prajakta Padmakar Bhosale    22  Female  Fourth Year        Wai
1       Ritesh Ramesh Gaikwad    21    Male   Third Year      Walwa
79                Vedanti Raut   19  Female   First Year     Warora
63         SUYOG SURESH AHIRE    20    Male   Third Year      Washi

[87 rows x 5 columns]

In [30]:
transposed_df = df.T

In [31]:
print(transposed_df)

                             0                       1   \
Name    Ravindra Ajinath Sanap   Ritesh Ramesh Gaikwad
Age                          22                      21
Gender                     Male                    Male
Year                 Third Year              Third Year
Taluka                    Ashti                   Walwa

                             2               3                        4   \
Name    Sakshi Ankush Bhalerao   Khushi Pathak   Aryan Rajendra Shingan
Age                          20              20                       21
Gender                   Female          Female                     Male
Year                 Third Year      Third Year               Third Year
Taluka                   Maval         Vadodara                    Karad

                          5                             6               7   \
Name    Ajay Krishna Jagdale  Niyati Pandharinath Wadekar   Malay Divekar
Age                       20                            20              20
Gender                  Male                        Female            Male
Year              Third Year                    Third Year      Third Year
Taluka                Haveli                        Maval                -

                         8                       9   ...              77  \
Name    Arti Kalyan Bankar   Shruti Santosh Jagtap   ...  Rutik Bhosale
Age                      20                      21  ...              20
Gender               Female                  Female  ...            Male
Year             Third Year              Third Year  ...      Third Year
Taluka             Jamkhed                 Paithan   ...      Sangamner

                             78            79            80  \
Name    Pranjal Jalindar Hinge   Vedanti Raut  Vivek sanap
Age                          18            19            18
Gender                   Female        Female          Male
Year                 First Year    First Year    First Year
Taluka                Ambegoan         Warora         Ashti

                          81                    82                         83  \
Name    Pathan fatin mustafa  Sakshee Sanjay Haral  Mayuresh Bapurao Babhale
Age                       18                    20                         18
Gender                  Male                Female                       Male
Year              First Year            Third Year                 First Year
Taluka                  Loha            Shrigonda                     Basmath

                            84                  85                      86
Name    Saurabh Santosh Kanade  Kalyani Ganesh Sul  Aniket Suhas Rupanawar
Age                         18                  19                      19
Gender                    Male              Female                    Male
Year                First Year          First Year              First Year
Taluka                  Parner             Indapur                 Indapur

[5 rows x 87 columns]

In [32]:
df_shape = df.shape

In [35]:
reshaped_df = df.Age

In [37]:
print(df_shape)

(87, 5)

In [38]:

print(reshaped_df)

0     22
1     21
2     20
3     20
4     21
      ..
82    20
83    18
84    18
85    19
86    19
Name: Age, Length: 87, dtype: int64